In [8]:
import pandas as pd
df = pd.read_csv("cafe4.csv")
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [9]:
# len() 길이

len(df)

8

In [ ]:
# sum()
cond = df["가격"] > 5000
sum(cond)

cond.sum()

3

In [ ]:
df.sum(numeric_only=True)

가격      37200.0
칼로리       730.0
이벤트가     2000.0
dtype: float64

In [14]:
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20   과테말라     NaN
5    밀크티  5900  210   과테말라     NaN
6     녹차  5300    0   대한민국     NaN
7   구미라떼  2000   20  코스타리카     NaN

In [ ]:
# transpose 행 열 바꿈

df.T

          0       1       2     3      4     5     6      7
메뉴    아메리카노    카페라떼    카페모카  카푸치노  에스프레소   밀크티    녹차   구미라떼
가격     4500    5000    5500  5000   4000  5900  5300   2000
칼로리      10     110     250   110     20   210     0     20
원산지    콜롬비아   코스타리카    과테말라  과테말라   과테말라  과테말라  대한민국  코스타리카
이벤트가    NaN  1000.0  1000.0   NaN    NaN   NaN   NaN    NaN